package 수정중_프로젝트;

public class Arr {

	String[] arr = {
			"물", "불", "돌", "눈", "땅", "손", "꽃", "길", "집", "산", "강", "달", "별", "차", "책", "쌀", "숲", "말", "몸", "값",
			"학교", "시계", "바다", "시장", "가방", "친구", "부모", "도서", "고양이", "도로", "노래", "사람", "사진", "비행", "소리", "우산", "지갑", "시간", "연필", "빵집",
			"자동차", "바나나", "도서관", "전화기", "사과나무", "축구장", "컴퓨터", "냉장고", "세탁기", "사진기", "우체국", "신문사", "주차장", "무지개", "자전거", "비행기", "지하철", "도자기", "핸드폰", "커피숍",
			"초등학교", "대학교수", "백화점", "자동판매", "축구선수", "컴퓨터실", "과일가게", "휴대전화", "소방차량", "산업혁명", "도서관장", "문화유산", "음악감상", "전화번호", "어린이집", "우편번호", "단편소설", "해양생물", "대중교통", "운동선수",
			"동물보호소", "자동판매기", "서울특별시", "전자레인지", "과학기술원", "공공도서관", "컴퓨터공학", "정보통신부", "농업진흥청", "교육지원청", "음악감상실", "도서관사서", "학술연구회", "과학기술원", "식품안전청", "교통신호등", "예술영화관", "전자상거래", "생활체육회", "고등어조림",
			"A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z",
			"a", "b", "d", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z",
			"AM", "QP", "NW", "BJ", "RX", "VD", "LK", "TF", "CZ", "GH", "DS", "YH", "UP", "KF", "EJ", "MW", "ZN", "RL", "HV", "SA",
			"am", "qp", "nw", "bj", "rx", "vd", "lk", "tf", "cz", "gh", "ds", "yh", "up", "kf", "ej", "mw", "zn", "rl", "hv", "sa",
			"ABC", "DEF", "GHI", "JKL", "MNO", "PQR", "STU", "VWX", "YZX", "ABC", "DEF", "GHI", "JKL", "MNO", "PQR", "STU", "VWX", "YZX", "ABC", "DEF",
			"abc", "def", "ghi", "jkl", "mno", "pqr", "stu", "vwx", "yzx", "abc", "def", "ghi", "jkl", "mno", "pqr", "stu", "vwx", "yzx", "abc", "def",
			"LOVE", "BIRD", "WIND", "JUMP", "FIRE", "BLUE", "GLOW", "MOON", "STAR", "CAMP", "HILL", "RACE", "BOMB", "WAVE", "TREE", "BARK", "SAND", "HUNT", "LAMP", "SHIP",
			"love", "bird", "wind", "jump", "fire", "blue", "glow", "moon", "star", "camp", "hill", "race", "bomb", "wave", "tree", "bark", "sand", "hunt", "lamp", "ship",
			"APPLE", "BRAVE", "CLOUD", "DRIVE", "EAGLE", "FIGHT", "GRAPE", "HOUSE", "IMAGE", "JUMPY", "KNIFE", "LIGHT", "MOUSE", "NIGHT", "OCEAN", "PLANT", "QUIET", "ROBOT", "SLEEP", "TRAIN",
			"apple", "brave", "cloud", "drive", "eagle", "fight", "grape", "house", "image", "jumpy", "knife", "light", "mouse", "night", "ocean", "plant", "quiet", "robot", "sleep", "train",
			"@", "#", "$", "!", "%", "&", "*", "(", ")", "?", "+", "-", "[", "]", "{", "}", ";", "|", "/",
			"@#", "$%", "&*", "(!", ")_", "-=", "+{", "}", "[|", ";:", "'<", ">/", "`~", "!?","%^", "*(", ")-", "_+", "{[", "]|",
			"!@#", "#$%", "&*(", ")-_", "=+{", "[]|", ";:'", "`~<", ">?,", "/!@", "#%^", "&*(", ")_+", "{|}", "`;:", "<>,", "?:/", "~`", "!@#", "#$%", "&*(",
			"@#&*", "($)^", "`~!/", "[]{}", "|;:'", "<>,.", "?/:", "-_+=", "(`)!", "^&*(", "[]|{}", "{;:'", ">?<,", ".//", "`~<>", "!@#$", "%^&*", "(#)!", ";:,'", "=+_`",
			"@#$%&", "()*_+", "[]{}|", ";:'<", ">?,./", "`~!@#", "$%^&*", "()-=_", "+{}[]", "|;:'\"", "<>?,/", "`~!@#", "%^&*(", "[]{}|", ";/<>?", "=+_`~", "!@#$%", "^&*()", "[{}]@", "~`!@#", "/<>?,"

	};
	
}
