package _JAVA_수업정리;

public class _JAVA_조건문 {

//		변수, 연산자, 조건, 반복문 찾기(분석->참일때, 거짓일때 어떤경우일때 어떻게할지 세세하게 분석하기)
//		그것을 코드로 만들기(이단계가 안되면 분석이 제대로 안된것)
//	
//		조건: 참(true)과 거짓(false)으로 구분
//		-> 연산자: 비교연산자(!=, ==, >, <, >=, <=)
//		** 조건을 사용하는 이유는 조건에 따라서 참과 거짓으로 구분하여 코드를 분리하기 위함**
//		*** 조건의 타입
//		ex) 1차 조건 : 조건 1개 (A)(if  / else)
//		     1차조건 2차조건 3차조건... : 1개씩 단일 조건존재 (B)(조건 각각에서 true/false가 나옴)(if  /else if  /else if)
//		     1차조건 만족 후 2차조건 : 연속적인 조건 (C)
//		(A타입의 예시 : 키가 160cm미만은 놀이기구를 못탐
//		 B타입의 예시 : 조편성을 키가 180cm 이상은 1조, 170~179cm는 2조, 169cm이하는 3조임
//		 C타입의 예시 : 일주일간 출결이 100%이면서 과제제출이 90%이상인 경우)
	
}
