package _JAVA_수업정리;

public class _JAVA_반복문 {
	
//		조건 : if (조건에 따라서 참과 거짓 로직을 달리함)
//			반복문 : for, while, do~while
//			-> 여기서의 반복은 '특정한 코드의 반복'을 의미함
//			반복문을 생각할 때 (반복할 코드(중복하여 나오는 부분)가 무엇인가), (반복할 값(변화하는 값)이 무엇인가)를 먼저 생각.
//	
//	
//			-for문의 형태-
//			for(초기값;조건;증감식){
//	
//			}
//			초기값은 일반적으로 변수를 선언
//			조건은 참과 거짓
//			증감식은 ++,--
//	
//			예제
//			for(int i=0;i<3;i++){
//				sysout("*");
//			}
//			이러한 반복문의 순서
//			-> 초기값(i=0) -> 조건판별(false면 exit)하여 true면-> 반복문 수행 -> 증감식
//			                         †-----------------------------------------------------
//			-> 즉 i가 0일때, 0<3을 판별하고, true이기 때문에 반복문을 실행하며 i를 1증가시켜 i=1로 만들어 다시 1<3을 판별...
	
}
