package _JAVA_수업정리;

public class _JAVA_2차원배열 {
	
//		<JAVA 2차원배열>
//	
//		1차원 배열: 연속적인 순서가 있다->index
//			   고정길이를 가지고 있다(선언시를 기준으로)->사이즈 수정이 불가하다.
//	
//		int [  ]  a  = {1,2,3,4,5,6,7,8,9}
//		6을 추출 => a[5]
//	
//		2차원 배열은? 1차원배열안에 1차원배열 / 행과열로 이루어져있다
//		int [  ][  ]  a  =  {{1,2,3},{4,5,6},{7,8,9}}
//		6을 추출 => a[1][2]
//	
//		예시)  0	 1   2(열의미)
//		----------------------
//		0 |     1   2   3
//		1 |     4   5   6
//		2 |     7   8   9
//		(행의미)    
//	
//	
//		행 -> 열의 순서로 읽을 수 있다.
//	
//		이것을 행과 열로 이루어진대로 추출하고싶을때,, -> 이중 for문을 사용할 수 있다.
//		1) i를 행으로 / j를 열로 보기로 정하기
//		2) 출력을 a[i][j]로 할것
//	
//		-> 이 계획대로 코드를 작성해보기
//		for(int i=0, i<3, i++){
//			for(int j=0, j<3, j++){
//				system.out.print(a[i][j]);
//			}
//			system.out.println();     -> 행이 바뀔때마다 줄바꿈이 필요하므로
//		}

}
